InformationRegisters/АналогиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>АналогиНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналог</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/АналогиНоменклатуры/Forms/ФормаВыбораАналога/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Организация = Параметры.Организация;
	Склад = Параметры.Склад;

	Контрагент = Параметры.Контрагент;
	ДоговорКонтрагента = Параметры.ДоговорКонтрагента;
		
	ВАльтернативнойЕдиницеИзмерения = Параметры.ВАльтернативнойЕдиницеИзмерения;
	НоменклатураРодитель = Параметры.Номенклатура;
	
	ТолькоВНаличии = Параметры.ТолькоВНаличии;
	ВидЦены = Параметры.ВидЦены;
	Если ВидЦены.Пустая() Тогда
		ВидЦены = ПолучитьОсновнойТипЦенПродажи();
	КонецЕсли;
	
	Валюта = Параметры.Валюта;
	Если Валюта.Пустая() Тогда
		Валюта = Константы.ВалютаУчета.Получить();
	КонецЕсли;
	Поставщик = Параметры.Поставщик;
	ИспользоватьЦеныПоставщиков = Параметры.ИспользоватьЦеныПоставщиков;
	Элементы.СписокАналоговЦенаПоставщика.Видимость = ИспользоватьЦеныПоставщиков;
	Элементы.СписокХарактеристикАналоговЦенаПоставщика.Видимость = ИспользоватьЦеныПоставщиков;

	УстановитьОтборПоАналогам();
	УстановитьЗначенияПараметровСпискаНоменклатуры();
	УстановитьЗначенияПараметровСпискаХарактеристик();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗначенияПараметровСпискаНоменклатуры()
	
	ДинамическийСписок = СписокАналогов;
	
	//ДинамическийСписок.Параметры.УстановитьЗначениеПараметра("ОтборПоВидуНоменклатуры", ОтборПоВидуНоменклатуры);
	
	ДинамическийСписок.Параметры.УстановитьЗначениеПараметра("Организация", Организация);
	ДинамическийСписок.Параметры.УстановитьЗначениеПараметра("Склад", Склад);
	
	ДинамическийСписок.Параметры.УстановитьЗначениеПараметра("ТолькоВНаличии", ТолькоВНаличии);
	ДинамическийСписок.Параметры.УстановитьЗначениеПараметра("ВАльтернативнойЕдиницеИзмерения", ВАльтернативнойЕдиницеИзмерения);
	
	ДинамическийСписок.Параметры.УстановитьЗначениеПараметра("ВидЦены", ВидЦены);
	ДинамическийСписок.Параметры.УстановитьЗначениеПараметра("Валюта", Валюта);
	ДинамическийСписок.Параметры.УстановитьЗначениеПараметра("ХарактеристикаНоменклатуры", Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());	
	ДинамическийСписок.Параметры.УстановитьЗначениеПараметра("Поставщик", Поставщик);
	ДинамическийСписок.Параметры.УстановитьЗначениеПараметра("ИспользуютсяОбщиеСклады", Константы.ОбщиеСклады.Получить());
	
	ДинамическийСписок.Параметры.УстановитьЗначениеПараметра("ИспользоватьИндивидуальныеЦены", ПолучитьФункциональнуюОпцию("ИспользоватьИндивидуальныеЦены"));
	ДинамическийСписок.Параметры.УстановитьЗначениеПараметра("Контрагент", Контрагент);
	ДинамическийСписок.Параметры.УстановитьЗначениеПараметра("ДоговорКонтрагента", ДоговорКонтрагента);
	
	ДинамическийСписок.Параметры.УстановитьЗначениеПараметра("НоменклатураРодительАналога", НоменклатураРодитель);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗначенияПараметровСпискаХарактеристик()
	
	ДинамическийСписок = СписокХарактеристикАналогов;
	
	ДинамическийСписок.Параметры.УстановитьЗначениеПараметра("Организация", Организация);
	ДинамическийСписок.Параметры.УстановитьЗначениеПараметра("Склад", Склад);
	
	ДинамическийСписок.Параметры.УстановитьЗначениеПараметра("ВидЦены", ВидЦены);
	ДинамическийСписок.Параметры.УстановитьЗначениеПараметра("Валюта", Валюта);
	ДинамическийСписок.Параметры.УстановитьЗначениеПараметра("Поставщик", Поставщик);
	ДинамическийСписок.Параметры.УстановитьЗначениеПараметра("ИспользуютсяОбщиеСклады", Константы.ОбщиеСклады.Получить());
	
	ДинамическийСписок.Параметры.УстановитьЗначениеПараметра("ИспользоватьИндивидуальныеЦены", ПолучитьФункциональнуюОпцию("ИспользоватьИндивидуальныеЦены"));
	ДинамическийСписок.Параметры.УстановитьЗначениеПараметра("Контрагент", Контрагент);
	ДинамическийСписок.Параметры.УстановитьЗначениеПараметра("ДоговорКонтрагента", ДоговорКонтрагента);	
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборПоАналогам()

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	АналогиНоменклатуры.Аналог КАК Номенклатура
	|ИЗ
	|	РегистрСведений.АналогиНоменклатуры КАК АналогиНоменклатуры
	|ГДЕ
	|	АналогиНоменклатуры.Номенклатура = &Номенклатура
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	АналогиНоменклатуры.Номенклатура
	|ИЗ
	|	РегистрСведений.АналогиНоменклатуры КАК АналогиНоменклатуры
	|ГДЕ
	|	АналогиНоменклатуры.Аналог = &Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура", НоменклатураРодитель);
	МассивНоменклатуры = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Номенклатура");;
		
	// фильтр удаляем/добавляем, поскольку УстановитьЭлементОтбораДинамическогоСписка затирает другие наложенные фильтры по НоменклатураСсылка (например отбор по разрешенной в рознице)
	// при удалении не передаем ИмяПоля, поиск только по наименованию отбора, иначе тоже затирает
	ОбластьОтбора = СписокАналогов.КомпоновщикНастроек.ФиксированныеНастройки.Отбор;
	ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(СписокАналогов, , "ОтборПоАналогам");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ОбластьОтбора, "Номенклатура", ВидСравненияКомпоновкиДанных.ВСписке, МассивНоменклатуры, "ОтборПоАналогам", Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьОсновнойТипЦенПродажи()
	Возврат Справочники.ВидыЦен.ОсновнаяЦенаПродажи;
КонецФункции

&НаКлиенте
Процедура СписокАналоговВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
		
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	СтандартнаяОбработка = Ложь;	
	
	Если ТекущиеДанные.ИмеютсяХарактеристики Тогда
		ПерейтиКСпискуХарактеристикНоменклатуры(ТекущиеДанные.Номенклатура, Истина);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКСпискуХарактеристикНоменклатуры(НоменклатураСсылка, ПоАналогам = Ложь)
	
	ПолеОтбора = "Номенклатура";
	ЭлементОтбора = Неопределено;
	Список = СписокХарактеристикАналогов;
	
	Для каждого ЭлементФиксОтбора Из Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы Цикл	
		Если ТипЗнч(ЭлементФиксОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
			Если ЭлементФиксОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ПолеОтбора) Тогда
				ЭлементОтбора = ЭлементФиксОтбора;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Элемент = ?(НЕ ЭлементОтбора = Неопределено, ЭлементОтбора, Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")));
	Элемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ПолеОтбора);
	Элемент.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Элемент.ПравоеЗначение = НоменклатураСсылка;	
	Элемент.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	Элемент.Использование = Истина;
	
	Элементы.СтраницыАналогов.ТекущаяСтраница = Элементы.СтраницаАналогиХарактеристики;
		
КонецПроцедуры

&НаКлиенте
Процедура ЗаменитьВДокументе(Команда)
		
	СтруктураВыбора = Новый Структура("Номенклатура, ХарактеристикаНоменклатуры, ЕдиницаИзмерения, Цена");
	Если Элементы.СтраницыАналогов.ТекущаяСтраница = Элементы.СтраницаАналогиХарактеристики Тогда
		ТекущиеДанные = Элементы.СписокХарактеристикАналогов.ТекущиеДанные;
	Иначе
		ТекущиеДанные = Элементы.СписокАналогов.ТекущиеДанные;
	КонецЕсли;
	Если ТекущиеДанные = Неопределено Тогда
		ПоказатьПредупреждение(, "Не выбрана позиция");
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(СтруктураВыбора, ТекущиеДанные);
	Если НЕ ЗначениеЗаполнено(СтруктураВыбора.ХарактеристикаНоменклатуры) Тогда
		СтруктураВыбора.ХарактеристикаНоменклатуры = ПредопределенноеЗначение("Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка");
	КонецЕсли;
	СтруктураВыбора.Вставить("Коэффициент", 1);
	СтруктураВыбора.Вставить("СерияНоменклатуры", ПредопределенноеЗначение("Справочник.СерииНоменклатуры.ПустаяСсылка"));
		
	Закрыть(СтруктураВыбора);
	
КонецПроцедуры
